Repository: Probesys/glpi-plugins-rgpdtools
Catalog: locales/*.po
Languages: fr_fr

source: RgpdTools
fr_fr: Utilitaires RGPD

# rgpdtools
source: Export successfully generated.
fr_fr: Export généré avec succès.

# rgpdtools
source: link(s) with the user where deleted successfully
fr_fr: lien(s) avec le(s) utilisateur(s) sélectionné(s) supprimé(s)

# rgpdtools
source: No links matching criteria were founded, no update query were executed.
fr_fr: Aucun lien trouvé correspondant aux filtres, aucune requête de mise à jour exécutée.

# rgpdtools
source: Logs contains information about the user were anonymize successfully.
fr_fr: Les logs contenant des informations relatives aux utilisateurs sélectionnés ont été anonymisés avec succès.

# rgpdtools
source: documents were deleted on server and database successfully.
fr_fr: documents ont été supprimés du serveur et de la base de données avec succès.

# rgpdtools
source: Error during installation of the rgpdtools plugin, please run "php composer.phar install --no-dev" in the plugin tree
fr_fr: Une erreur est survenue pendant l'installation du plugin rgpdtools, merci de lancer la commande "php composer.phar install --no-dev" depuis le dossier du plugin

# rgpdtools
source: user is required
fr_fr: vous devez sélectionner un utilisateur

# rgpdtools
source: user is required or all user checkbox
fr_fr: vous devez sélectionner un utilisateur ou tout les utilisateurs

# rgpdtools
source: Are you sure you want to execute this operation
fr_fr: Etes vous certain de vouloir exécuter cette opération

# rgpdtools
source: Export users data
fr_fr: Export des données de l'utilisateur

# rgpdtools
source: Choosing what to export
fr_fr: Sélectionner les éléments à exporter

# rgpdtools
source: Removal of links to the user
fr_fr: Suppression des liens vers l'utilisateur

# rgpdtools
source: Choice of elements for which to remove links to the user
fr_fr: Sélection des types d'éléments pour lesquels supprimer les liens avec l'utilisateur

# rgpdtools
source: For each item, retention period
fr_fr: Pour chaque type d'élément, durée de rétention

# rgpdtools
source: Apply to all users
fr_fr: Appliquer à tout les utilisateurs

# rgpdtools
source: Purge logs referring to the user
fr_fr: Suppression des logs faisant référence à l'utilisateur

# rgpdtools
source: Retention Period
fr_fr: Durée de rétention

# rgpdtools
source: Delete old uploaded documents
fr_fr: Supprimer tout les documents téléchargés

# rgpdtools
source: The class %1$s can't be instanciate because not finded on GLPI.
fr_fr: La classe %1$s n'a pu être instancé car elle n'est pas présente dans GLPI.
